tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "teamookla/speedtest"
brew "btop"
brew "docker-completion"
brew "exa"
brew "starship"
brew "tmux"
brew "teamookla/speedtest/speedtest"
cask "alt-tab"
cask "discord"
cask "firefox-developer-edition"
cask "fork"
cask "intellij-idea"
cask "iterm2"
cask "obsidian"
cask "postman"
cask "rectangle"
cask "visual-studio-code-insiders"
