tap "derailed/k9s"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "teamookla/speedtest"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Cloudflare Tunnel client (formerly Argo Tunnel)
brew "cloudflared"
# Bash, Zsh and Fish completion for Docker
brew "docker-completion"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Modern load testing tool, using Go and JavaScript
brew "k6"
# Command-line tool to kill processes listening on a specific port
brew "killport"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Development kit for the Java programming language
brew "openjdk@17"
# Development kit for the Java programming language
brew "openjdk@21"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Cross-shell prompt for astronauts
brew "starship"
# User interface to the TELNET protocol
brew "telnet"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Utilities to create and convert Web Open Font File (WOFF) files
brew "woff2"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "derailed/k9s/k9s"
# Vault
brew "hashicorp/tap/vault"
# Ookla Speedtest
brew "teamookla/speedtest/speedtest"
# Enable Windows-like alt-tab
cask "alt-tab"
# Voice and text chat software
cask "discord"
cask "font-fira-code-nerd-font"
cask "font-monaspace"
cask "font-monocraft"
# GIT client
cask "fork"
# Java IDE by JetBrains
cask "intellij-idea"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Menu bar manager
cask "jordanbaird-ice"
# Open-source keystroke visualiser
cask "keycastr"
# Clipboard manager
cask "maccy"
# Calculator and converter application
cask "numi"
# Collaboration platform for API development
cask "postman"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Screenshot measurement and annotation tool
cask "shottr"
# Unpacks archive files
cask "the-unarchiver"
# Tool to invert scroll direction for physical scroll wheels
cask "unnaturalscrollwheels"
# Code editor
cask "visual-studio-code-insiders"
